In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [6]:
df=pd.read_csv(r"E:\\csv\train.csv")

In [7]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
print("The number of samples in dataset ", df.shape[0])

The number of samples in dataset  891

In [11]:
print("The number of values in target vector(Survived)",df.Survived.count())

The number of values in target vector(Survived) 891

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
x=df.drop("Survived",axis=1)

In [15]:
y=df.Survived

In [18]:
from sklearn.model_selection import train_test_split as ts

In [19]:
x_train,x_test,y_train,y_test=ts(x,y,test_size=0.2,random_state=1)

In [22]:
x_train,x_val,y_train,y_val=ts(x_train,y_train,test_size=0.2,random_state=1)

In [23]:
print("shape of the training data:", x_train.shape)

shape of the training data: (427, 11)

In [24]:
print("shape of testing data:", x_test.shape)

shape of testing data: (179, 11)

In [25]:
print("shape of the validation data:", x_val.shape)

shape of the validation data: (107, 11)

In [26]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [29]:
df=pd.read_csv(r"E:\csv\train.csv")

In [30]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
print("The number of sample in dataset is", df.shape[0])

The number of sample in dataset is 891

In [32]:
print("the number of sample feature in dataset is", df.shape[1])

the number of sample feature in dataset is 12

In [35]:
print("The number of values in target vector(survived)",df.Survived.count())      ....................................

The number of values in target vector(survived) 891

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [37]:
x=df.drop("Survived",axis=1)

In [38]:
y=df["Survived"]

In [39]:
from sklearn.model_selection import train_test_split as ts

In [40]:
x_train,x_test,y_train,y_test=ts(x,y,test_size=0.2,random_state=1)

In [41]:
x_train,x_val,y_train,y_val=ts(x_train,y_train,test_size=0.2,random_state=1)

In [42]:
print("shape of training data",x_train.shape)

shape of training data (569, 11)

In [43]:
print("shape of testing data",x_test.shape)

shape of testing data (179, 11)

In [44]:
print("shape of the validation data",x_val.shape)

shape of the validation data (143, 11)